leonf08/SMBUS_PMBUS-Stack-STM32F407/SMBUS_Atolic/SMBUS_PMBUS_Stack/Src/stm32_SMBUS_stack.c
/**
  ******************************************************************************
  * @file    stm32_SMBUS_stack.c
  * @author  MCD Application Team
  * @version V2.0.1
  * @date    28-June-2017
  * @brief   This file provides a set of functions needed to manage the SMBUS STACK.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_SMBUS_stack.h"
#include "stm32_PMBUS_stack.h"

/** @addtogroup STM32_SMBUS_STACK
  * @{
  */

/** @defgroup STM32_SMBUS_STACK_Defines
  * @{
  */
#define SMBUS_INSTANCES_COUNT   ((uint8_t)2)  /*!< how many stacks can we run in parallel, initialized */

/**
  * @}
  */

/** @defgroup STM32_SMBUS_STACK_Constants SMBus stack data constants
  * @{
  */
const SMBUS_ZoneStateTypeDef ZERO_ZONE = {0, 0, 0, 0};
/*!<
    Zone structure init value - no zone
 */

st_command_t ALERT_RESPONSE = {0, READ, 0, 1};
/*!<
    dedicated command definition for the alert response protocol:
 */

st_command_t HOST_NOTIFY_PROTOCOL = { 0, WRITE, 3, 0};
/*!<
    dedicated command definition for the host notify protocol:
 */

st_command_t PMBUS_COMMANDS_ARP[] =
  {
    { SMBUS_ARP_CC_PREPARE, WRITE, 1, 0 },
    { SMBUS_ARP_CC_RESET, WRITE, 1, 0 },
    { SMBUS_ARP_CC_GET_ID, BLOCK_READ, 1, 18 },
#ifdef  HOST1
    { SMBUS_ARP_CC_ASSIGN, BLOCK_WRITE, 18, 0 },
#else
    { SMBUS_ARP_CC_ASSIGN, BLOCK_WRITE, 1, 0 }, /* really it is 19 bytes written, but we need this command to be treated in a special way */
#endif
  };
/*!<
    dedicated command definition table for the address resolution protocol:
 */

/**
  * @}
  */

/** @defgroup STM32_SMBUS_STACK_Variables
  * @{
  */

/**
  A list in which the SMBUS stack instances are registered. The purpose is to
  identify correct working context for each action. The rule is that no more than
  one instance per physical interface is possible
 */
SMBUS_StackHandleTypeDef* SMBUSInstancesList[SMBUS_INSTANCES_COUNT];

/**
  * @}
  */

/** @defgroup STM32_SMBUS_STACK_Interfaces
  * @{
  */

/**
  * @brief  SMBUS stack identification based on HW resource.
  * @param  hsmbus : Pointer to a SMBUS_HandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @retval Pointer to relevant stack instance.
  */
SMBUS_StackHandleTypeDef* STACK_SMBUS_ResolveContext( SMBUS_HandleTypeDef *hsmbus )
{
  SMBUS_StackHandleTypeDef* pSelected = NULL;
  uint32_t index = 0;

  /*
    Basically match the physical device with stack instance
   */
  do
  {
    /*
      The loop is searching for the first stack context instance initialized to
      use the actual HAL Driver handle
     */
    pSelected = SMBUSInstancesList[index];
    if  ( pSelected->Device != hsmbus )
    {
      pSelected = NULL;
    }
    index++;
  }
  while ((index < SMBUS_INSTANCES_COUNT ) && ( pSelected == NULL ));

  /*
    Error - no identified stack instance
   */
  return pSelected;
}

/**
  * @brief  Master Tx Transfer completed callbacks.
  * @param  hsmbus : Pointer to a SMBUS_HandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @retval None
  */
void HAL_SMBUS_MasterTxCpltCallback(SMBUS_HandleTypeDef *hsmbus)
{
  SMBUS_StackHandleTypeDef*    pStackContext;
  uint16_t              size;

  /*
    Resolve which stack serves the port that initiated callback
   */
  pStackContext = STACK_SMBUS_ResolveContext( hsmbus );

  /* Transmission phase is completed */
  pStackContext->StateMachine &= ~SMBUS_SMS_TRANSMIT;

  /*
    NOTE - optionally clear the buffer here
  */

#ifdef PMBUS13
  /* If this is a READ_ZONE, then it gets special treatment.
    Only simple status read is supported in this example */
  if ( pStackContext->SlaveAddress == SMBUS_ADDR_ZONE_READ )
  {
    /* Requesting next response */
    STACK_PMBUS_MasterZoneReadStatusCont(pStackContext);
    return;
  }
#endif

  /*
   Is there data to receive after transfer?
   check if the command includes reading phase and if application that invoked
   the command cared for receiving data from the slave
  */
  if ( pStackContext->CurrentCommand != 0U )
  {
    if (
      ( ( pStackContext->CurrentCommand->cmnd_query & BLOCK ) == BLOCK ) && \
      (
        ( ( pStackContext->CurrentCommand->cmnd_query & PROCESS_CALL ) == PROCESS_CALL ) || \
        ( ( pStackContext->OpMode & READ ) == READ )
      )
    )
    {
      /*
        the amount of data to be read is yet to be sent by the slave - reading the byte count now:
      */
      pStackContext->StateMachine |= SMBUS_SMS_RECEIVE | SMBUS_SMS_PROCESSING;
      HAL_SMBUS_Master_Sequential_Receive_IT( hsmbus, pStackContext->SlaveAddress, &(pStackContext->Buffer[1]), 1, SMBUS_NEXT_FRAME );
    }
    else if ((pStackContext->CurrentCommand->cmnd_master_Rx_size > 0 ) && (( pStackContext->OpMode & WRITE ) == 0 ))
    {
      /*
        the amount of data to be read is known and determined by the command code
      */
      pStackContext->StateMachine |= SMBUS_SMS_RECEIVE;
      size = pStackContext->CurrentCommand->cmnd_master_Rx_size;
      if ( pStackContext->StateMachine & SMBUS_SMS_PEC_ACTIVE )
      {
        size += 1;
      }
      HAL_SMBUS_Master_Sequential_Receive_IT( hsmbus, pStackContext->SlaveAddress, &(pStackContext->Buffer[1]), size, SMBUS_LAST_FRAME | ( pStackContext->StateMachine & SMBUS_SMS_PEC_ACTIVE ));
    }
  }
  else
  {
    /*
      There was an alert during command that we could not treat before
     */
    STACK_SMBUS_ReadyIfNoAlert( pStackContext );
  }
  HAL_SMBUS_EnableAlert_IT(hsmbus);
}

/**
  * @brief  Master Rx Transfer completed callbacks.
  * @param  hsmbus : Pointer to a SMBUS_HandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @retval None
  */
void HAL_SMBUS_MasterRxCpltCallback(SMBUS_HandleTypeDef *hsmbus)
{
  SMBUS_StackHandleTypeDef* pStackContext;
  uint8_t            size;

