leonf08/SMBUS_PMBUS-Stack-STM32F407/SMBUS_Atolic/SMBUS_PMBUS_Stack/Src/stm32_SMBUS_stack.c
  /*
    Resolve which stack serves the port that initiated callback
   */
  pStackContext = STACK_SMBUS_ResolveContext( hsmbus );

#ifdef PMBUS13
  /* If this is a READ_ZONE, then it gets special treatment.
    Only simple status read is supported in this example */
  if ( pStackContext->SlaveAddress == SMBUS_ADDR_ZONE_READ )
  {
    /* Third byte - page number?
    if (pStackContext->Byte_count == 2)
    {
      pStackContext->Device->XferSize++;
    }*/
    /* Fail-safe stopping the Zone Read on empty answer */
    if ( pStackContext->Buffer[0] != 0xFF )
    {
      pStackContext->Device->PreviousState = HAL_SMBUS_STATE_BUSY_TX;
      STACK_PMBUS_MasterZoneReadStatusCont(pStackContext);
    }
    else
    {
      /*
        There could be an alert during command that we could not treat before
      */
      STACK_SMBUS_ReadyIfNoAlert( pStackContext );
    }
    return;
  }
#endif

  if ( pStackContext->StateMachine & SMBUS_SMS_RECEIVE )
  {
    /*
      Reception completed
     */
    pStackContext->StateMachine &= ~SMBUS_SMS_RECEIVE;

    /*
      A case of block transfer follow-up follows
     */
    if ( ( pStackContext->CurrentCommand->cmnd_query & BLOCK ) && ( pStackContext->StateMachine & SMBUS_SMS_PROCESSING ) )
    {
      /*
        the amount of data to be read was sent by the slave - it is on position 1 of the IO buffer
        is limited to STACK_NBYTE_SIZE
      */
      if ( pStackContext->Buffer[1] > STACK_NBYTE_SIZE )
      {
        pStackContext->Buffer[1] = STACK_NBYTE_SIZE;
      }

      if (  pStackContext->Buffer[1] == 0 )
      {
        /*
        special case - slave indicates it has no further data to send
        We generate stop and close the frame
        */
        STACK_SMBUS_ReadyIfNoAlert( pStackContext );
      }
      else
      {
        /*
          This will conclude the block processing, we clear the flag
         */
        pStackContext->StateMachine &= ~SMBUS_SMS_PROCESSING;

        /*
          Reception next
          Usually there is something left to be read, we continue on position 2 of the IO buffer
         */
        pStackContext->StateMachine |= SMBUS_SMS_RECEIVE;
        size = pStackContext->Buffer[1];
        /* Applying upper limit on read size */
        if ( size > pStackContext->CurrentCommand->cmnd_master_Rx_size )
        {
          size = pStackContext->CurrentCommand->cmnd_master_Rx_size;
        }
        HAL_SMBUS_Master_Sequential_Receive_IT( hsmbus, pStackContext->SlaveAddress, &(pStackContext->Buffer[2]), size, SMBUS_LAST_FRAME  | ( pStackContext->StateMachine & SMBUS_SMS_PEC_ACTIVE ));
      }
    }
    else
    {
      /*
        There could be an alert during command that we could not treat before
      */
      STACK_SMBUS_ReadyIfNoAlert( pStackContext );
    }
  }
  else
  {
    pStackContext->StateMachine |= SMBUS_SMS_ERROR;
  }
  /* Program should not reach this statement */
  HAL_SMBUS_EnableAlert_IT(hsmbus);
}

/**
  * @brief  SMBUS alert signalling (device only).
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @retval None
  */
void STACK_SMBUS_SendAlert( SMBUS_StackHandleTypeDef* pStackContext )
{
  /*
    check mode consistency - device only sends
   */
  if ( ( pStackContext->Device->Instance->CR1 & SMBUS_PERIPHERAL_MODE_HOST ) == 0)
  {
    pStackContext->Device->Instance->CR1 |= I2C_CR1_ALERT;
  }
}

/**
  * @brief  SMBUS error callbacks.
  * @param  hsmbus : Pointer to a SMBUS_HandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @retval None
  */
void HAL_SMBUS_ErrorCallback(SMBUS_HandleTypeDef *hsmbus)
{
  SMBUS_StackHandleTypeDef* pStackContext;
  uint32_t  error = hsmbus->ErrorCode;

  pStackContext = STACK_SMBUS_ResolveContext( hsmbus );

  if ( error & HAL_SMBUS_ERROR_ALERT)
  {
    /*
      alert signal detected, update state
     */
    pStackContext->StateMachine |= SMBUS_SMS_ALERT_PENDING;

    if ( (pStackContext->StateMachine & SMBUS_SMS_ACTIVE_MASK) != 0 )
    {
    	if((pStackContext->StateMachine & SMBUS_SMS_READY) != SMBUS_SMS_READY)
    	{
    		pStackContext->StateMachine |= SMBUS_SMS_READY;
    	}

    	/*
        The stack is not busy - we can react immediately
    	*/
    	pStackContext->CurrentCommand = &ALERT_RESPONSE;

    	STACK_SMBUS_HostRead( pStackContext, (uint8_t*)&(pStackContext->OwnAddress) , SMBUS_ADDR_ARA);
    }

    /*
     the alert has been treated, clear the flag
     */
    error &= ~HAL_SMBUS_ERROR_ALERT;
  }
  else if ( error & (HAL_SMBUS_ERROR_BERR | HAL_SMBUS_ERROR_BUSTIMEOUT | HAL_SMBUS_ERROR_HALTIMEOUT ))
  {
    /*
      Critical error plagued the command - reset the stack
     */
    if ( STACK_SMBUS_IsBusy(pStackContext))
    {
      __HAL_SMBUS_DISABLE( hsmbus );
      while ( hsmbus->Instance->CR1 & I2C_CR1_PE )
      {}
      __HAL_SMBUS_ENABLE( hsmbus );
      if ( pStackContext->Device->State != HAL_SMBUS_STATE_READY )
      {
        HAL_SMBUS_DeInit( pStackContext->Device );
        HAL_SMBUS_Init( pStackContext->Device );
      }
    }
    pStackContext->StateMachine |= SMBUS_SMS_READY;
    pStackContext->CurrentCommand = NULL;
    pStackContext->StateMachine &= ~SMBUS_SMS_ACTIVE_MASK;

  }
  else if ( error & HAL_SMBUS_ERROR_OVR)
  {
    /*
      A case of quick command read probably, setting the flag
     */
    pStackContext->StateMachine |= SMBUS_SMS_QUICK_CMD_R | SMBUS_SMS_READY;
    HAL_SMBUS_Master_Abort_IT( hsmbus, pStackContext->SlaveAddress );
    hsmbus->ErrorCode = HAL_SMBUS_ERROR_NONE;
  }
  else if ( error & HAL_SMBUS_ERROR_ARLO)
  {
#ifdef PMBUS13
    /* Zone Read arbitration lost - retry */
    if (( pStackContext->SlaveAddress == SMBUS_ADDR_ZONE_READ ) && ((pStackContext->StateMachine & SMBUS_SMS_ZONE_READ) != 0 ))
    {
      pStackContext->StateMachine &= ~SMBUS_SMS_ZONE_READ;
      __SMBUS_ZONE_ENABLE(hsmbus);
    }
    else
    {
#endif /* PMBUS13 */
      /*
        Arbitration lost, giving up
      */
      CLEAR_BIT(hsmbus->Instance->CR1, I2C_CR1_ACK);

