leonf08/SMBUS_PMBUS-Stack-STM32F407/SMBUS_Atolic/SMBUS_PMBUS_Stack/Src/stm32_SMBUS_stack.c
      if ( hsmbus->Instance->SR1 & I2C_SR1_ADDR )
      {
        __HAL_SMBUS_CLEAR_ADDRFLAG(hsmbus);
      }

      /*
      Clearing the rest of the transmission, including the HW buffer of peripheral
      */
      hsmbus->Instance->SR1 |= I2C_SR1_TXE;
      hsmbus->XferCount = 0;
      hsmbus->XferSize = 0;
      hsmbus->XferOptions = 0;

      /*
        Putting the stack back to original state.
      */
      pStackContext->StateMachine &= ~SMBUS_SMS_TRANSMIT | SMBUS_SMS_RESPONSE_READY | SMBUS_SMS_PROCESSING;
      pStackContext->StateMachine |= SMBUS_SMS_IGNORED | SMBUS_SMS_READY;
#ifdef PMBUS13
    }
#endif  /* PMBUS13 */
  }
  else if ( error & HAL_SMBUS_ERROR_ACKF )
  {
    pStackContext->Device->PreviousState = hsmbus->State;
    pStackContext->Device->State = HAL_SMBUS_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(pStackContext->Device);

    /* Cease the transmit/receive effort */
    pStackContext->StateMachine &= ~(SMBUS_SMS_TRANSMIT | SMBUS_SMS_RECEIVE);
    STACK_SMBUS_ReadyIfNoAlert(pStackContext);
    error = 0;
  }

  /*
    keep any other error marked in the state machine
   */
  pStackContext->StateMachine |= error << 16;

  /*
    and clear the record of error in the hal driver
   */
  hsmbus->ErrorCode = HAL_SMBUS_ERROR_NONE;
}

/**
  * @brief  function determines if the address could identify this device.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  AddrMatchCode: Address Match Code
  * @retval ErrorStatus ERROR if address is not recognized as own.
  */
__weak ErrorStatus STACK_SMBUS_AddrAccpt( SMBUS_StackHandleTypeDef* pStackContext, uint16_t AddrMatchCode)
{
  ErrorStatus retvalue = ERROR;

  /*
   A device could have fixed address, support the ARP or answer to a general call.
   */
#ifdef ARP      /* Address resolution protocol follows */

  /* ARP address match - general call*/
  if (AddrMatchCode == SMBUS_ADDR_DEFAULT )
  {
    /* set the flag that the current call is ARP */
    pStackContext->StateMachine |= SMBUS_SMS_ARP_AM;
    retvalue = SUCCESS;
  }
#endif /*ARP supported*/

#ifdef PMBUS13

  /* Zone command address */
  if ( (AddrMatchCode == SMBUS_ADDR_ZONE_READ ) || (AddrMatchCode == SMBUS_ADDR_ZONE_WRITE ))
  {

   if ( pStackContext->StateMachine & SMBUS_SMS_ZONE_READ )
   {
     retvalue = ERROR;
   }
   else
   {
    retvalue = SUCCESS;
   }
  }
#endif /* PMBUS13 */

  /* Own address match */
  if (AddrMatchCode == pStackContext->OwnAddress )
  {
    retvalue = SUCCESS;
  }

  /* NOTE : This function Should not be modified, when the callback is needed,
           the STACK_SMBUS_AddrAccpt could be implemented in the user file
  */
  return retvalue;
}

/**
  * @brief  Function optionally extending the ExecuteCommand to be ARP capable
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the context information for the specified SMBUS stack.
  * @retval HAL_StatusTypeDef response code. Equal STACK_OK if success.
  */
__weak HAL_StatusTypeDef STACK_SMBUS_ExecuteCommandARP( SMBUS_StackHandleTypeDef* pStackContext )
{
  HAL_StatusTypeDef result = STACK_OK;
#ifdef ARP      /* Address resolution protocol follows */
  uint32_t index;
  /*
    Host should implement it's reaction to Host notify protocol and ARP Host notify.
    Regular devices implement all the commands they support.
	Instead of modifying directly this function, use the weak property to replace it.
   */

  if ( pStackContext->CurrentCommand == &(PMBUS_COMMANDS_ARP[0]))
  {
    /*
      1. reset the AR flag
     */
    pStackContext->StateMachine &= ~( SMBUS_SMS_ARP_AR );
    /*
      2. regenerate random UDID part - not implemented in this example
     */
  }
  else
    if ( pStackContext->CurrentCommand == &(PMBUS_COMMANDS_ARP[1]) )
    {
      /*
       1. reset the ARP flags
      */
#ifdef  DEV_PSA /* persistent address prevents AV reset*/
      pStackContext->StateMachine &= ~( SMBUS_SMS_ARP_AR );
#else /* DEV_PSA */
      pStackContext->StateMachine &= ~( SMBUS_SMS_ARP_AV | SMBUS_SMS_ARP_AR );
#endif /* DEV_PSA */
      /*
        2. regenerate random UDID part
       */
    }
    else
      if ( pStackContext->CurrentCommand ==  &(PMBUS_COMMANDS_ARP[2]))
      {
        /*
          1. Copy the UDID to the buffer (preparing answer )
         */
        for ( index = 2; index < 18; index++ )
        {
          pStackContext->Buffer[index] = pStackContext->ARP_UDID[index-2];
        }

        pStackContext->Buffer[1] = 17;
        pStackContext->Buffer[18] = pStackContext->OwnAddress;
      }
      else
        if ( pStackContext->CurrentCommand == &(PMBUS_COMMANDS_ARP[3]))
        {
          if ( (pStackContext->StateMachine & SMBUS_SMS_IGNORED ) == 0)
          {
            /*
             This is a new address assigned by the bus host
              this slave has to remember it
             */
            pStackContext->StateMachine |= SMBUS_SMS_ARP_AV | SMBUS_SMS_ARP_AR;
            pStackContext->OwnAddress = pStackContext->Buffer[18];
            pStackContext->Device->Instance->OAR1 = (I2C_OAR1_OA1EN | pStackContext->Buffer[18]);
          }
        }
        else
        {
          /* no command selected - could be that the stack NACKed previous write and now is the read phase */
          result = STACK_ERROR;
        }
#endif /*ARP*/

  /*
    Returning zero means no problem with execution, if reply is expected, then it is correctly placed in the IO buffer
   */
  return result;
}

#ifdef ARP

/**
  * @brief a subroutine of the LocateCommand called in case or ARP
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @param  commandCode : the command code byte value read from input buffer
  * @retval None
  */
void STACK_SMBUS_LocateCommandARP( SMBUS_StackHandleTypeDef* pStackContext, uint8_t commandCode )
{
  switch ( commandCode )
  {
#ifdef  DEV_DIS /* discoverable device only */
    case SMBUS_ARP_CC_PREPARE:
      /* Prepare for ARP command incoming */
      pStackContext->CurrentCommand = &(PMBUS_COMMANDS_ARP[0]);
      break;
    case SMBUS_ARP_CC_RESET:
      /* ARP reset command incoming */
      pStackContext->CurrentCommand = &(PMBUS_COMMANDS_ARP[1]);
      break;
    case SMBUS_ARP_CC_GET_ID:
      /* ID reading command - we only answer if address is not resolved yet */
      if ( ( pStackContext->StateMachine & SMBUS_SMS_ARP_AR ) == 0 )
      {
        pStackContext->CurrentCommand = &(PMBUS_COMMANDS_ARP[2]);
      }
      else
      {
        /* do the best to avoid replying on that command */
        pStackContext->StateMachine |= SMBUS_SMS_IGNORED;
      }
      break;
    case SMBUS_ARP_CC_ASSIGN:
      /* Address assignment from host */
      pStackContext->CurrentCommand = &(PMBUS_COMMANDS_ARP[3]);
      break;
#endif /* DEV_DIS */
    default:
      if ( pStackContext->StateMachine & SMBUS_SMS_ARP_AV )
      {
        /* directed command for this device only, address must be valid then */
        if ( commandCode ==  ( pStackContext->OwnAddress | 0x01 ) )
        {
          /* GetID again */
          pStackContext->CurrentCommand = &(PMBUS_COMMANDS_ARP[2]);
        }
#ifdef DEV_DIS
        else if ( commandCode == pStackContext->OwnAddress )
        {
          /* reset command */
          pStackContext->CurrentCommand = &(PMBUS_COMMANDS_ARP[1]);
        }
#endif /* DEV_DIS */
      }
      break;
  }
  return;
}
#endif /*ARP */

/**
  * @brief  locates a received command in the supported command table
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @retval None
  */
__weak void STACK_SMBUS_LocateCommand( SMBUS_StackHandleTypeDef* pStackContext )
{
  uint8_t       commandCode = pStackContext->Buffer[0];
#ifdef      DENSE_CMD_TBL
  uint32_t      current, low, top;
#endif

#ifdef  ARP
  if ( pStackContext->StateMachine & SMBUS_SMS_ARP_AM )
  {
    /* on default device address we do not seek in default command table */
    STACK_SMBUS_LocateCommandARP( pStackContext, commandCode );

