leonf08/SMBUS_PMBUS-Stack-STM32F407/SMBUS_Atolic/SMBUS_PMBUS_Stack/Src/stm32_SMBUS_stack.c
  }
  else
#endif /* ARP treatment */
  {
    /*
       Code searching for command based on command code
     */
#ifdef      DENSE_CMD_TBL

    /*
      initializing the command code search - the table must have all commands sorted, but there may be gaps
     */
    low = 0;
    top = pStackContext->CMD_tableSize - 1;
    pStackContext->CurrentCommand = NULL;

    while ( top >= low )
    {
      /*
        Pick interval half
       */
      current = ( low + top ) >> 1 ;
      if (pStackContext->CMD_table[current].cmnd_code == commandCode)
      {
        /*
          we have found our command
         */
        pStackContext->CurrentCommand = &(pStackContext->CMD_table[current]);
        return;
      }
      else if (pStackContext->CMD_table[current].cmnd_code < commandCode)
      {
        /*
          Look at upper half
         */
        low = current + 1;
      }
      else
      {
        top = current - 1;
      }
    }
#else
    /*
    Simple command table - command code equals the table index
    */
    pStackContext->CurrentCommand = &(pStackContext->CMD_table[commandCode]);

    /* a sanity check */
    if ( pStackContext->CurrentCommand->cmnd_code != commandCode )
    {
      pStackContext->CurrentCommand = NULL;
    }
#endif
  }
}

/**
  * @brief  This callback informs the host side application SW that an Alert has been
  *         treated and there is received alert address in the context.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @retval None
  */
__weak void STACK_SMBUS_AlertClbk( SMBUS_StackHandleTypeDef* pStackContext )
{
  /*
   Do not modify this function directly, replace it with own version in your code
   */
  return;
}

/**
  * @brief  check if alert is pending and treat it, otherwise reset state machine
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @retval None
  */
void STACK_SMBUS_ReadyIfNoAlert( SMBUS_StackHandleTypeDef* pStackContext )
{

  if ((pStackContext->StateMachine & SMBUS_SMS_ALERT_PENDING) == SMBUS_SMS_ALERT_PENDING )
  {
    /*
      During a command processing, a device signalled an alert
     */
    if (pStackContext->CurrentCommand != &ALERT_RESPONSE)
    {
      /*
       Last command was not an alert response - we send alert response
       */
      pStackContext->CurrentCommand = &ALERT_RESPONSE;
      pStackContext->StateMachine |= SMBUS_SMS_READY;
      STACK_SMBUS_HostRead( pStackContext, &(pStackContext->OwnAddress) , SMBUS_ADDR_ARA);
    }
    else
    {
      /*
       Means we already sent alert response and the address has been read
       */
      pStackContext->StateMachine |= SMBUS_SMS_READY | SMBUS_SMS_ALERT_ADDRESS;

      /*
       the callback...
       */
      STACK_SMBUS_AlertClbk( pStackContext );
    }
  }
  else
  {
    /*
    No alert, Master is ready to poke another device
    */
    pStackContext->StateMachine |= SMBUS_SMS_READY;
    pStackContext->CurrentCommand = NULL;
  }
}

/**
  * @brief  SMBUS initialization routine.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @retval SMBus stack return code
  */
HAL_StatusTypeDef STACK_SMBUS_Init( SMBUS_StackHandleTypeDef* pStackContext )
{
  uint32_t              index = 0;
  HAL_StatusTypeDef     result = STACK_OK;

  while ( SMBUSInstancesList[index] != NULL )
  {
    index++;
  }

  pStackContext->SlaveAddress = 0;

  SMBUSInstancesList[index] = pStackContext;

  /*
   No mode, nothing going on
   */
  pStackContext->StateMachine |= SMBUS_SMS_READY;
  pStackContext->OpMode = 0;

#ifdef PMBUS13
  /* initializing the Zone settings */
  pStackContext->TheZone = ZERO_ZONE;
#endif /* PMBUS13 */

#ifdef ALERT
  /*
    If master is initialized
   */
  if ( pStackContext->Device->Instance->CR1 & SMBUS_PERIPHERAL_MODE_HOST )
  {
    /*
     Alert is by default enabled for a host
    */
    result = HAL_SMBUS_EnableAlert_IT( pStackContext->Device );
  }
#endif /* ALERT */

  /*
    the device listens for common commands, the host for notify protocol
   */
  if ( result == STACK_OK )
  {
    return HAL_OK;
  }
  else
  {
    return result;
  }
}

/**
  * @brief  SMBUS IO buffer access function. Returns a valid address if buffer can be written by application.
  *        Returns NULL if the stack or driver is busy using the buffer. Application should not store the pointer
  *        and always retrieve the buffer this way to check availability.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the configuration information for the specified SMBUS.
  * @retval I/O buffer
  */
uint8_t* STACK_SMBUS_GetBuffer( SMBUS_StackHandleTypeDef* pStackContext )
{
  uint8_t* pResult;
  /*
    return NULL if the stack/driver is busy
   */
  if (
    ( STACK_SMBUS_IsBusy(pStackContext) ) ||
    (
      ( pStackContext->Device->State != HAL_SMBUS_STATE_READY ) &&
      ( pStackContext->Device->State != HAL_SMBUS_STATE_LISTEN )
    )
  )
  {
    pResult = NULL;
  }
  else
  {
    /*
      starts at second position, first is reserved for the command code
     */
    pResult = &(pStackContext->Buffer[1]);
  }
  return pResult;
}

/**
  * @brief  SMBUS master command transmit.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the context information for the specified SMBUS stack.
  * @param  pCommand : description of the command to be transmitted, NULL for quick command
  * @param  address : slave address to be used in the transmission
  * @param  direction : either READ or WRITE, some commands have the choice with the same ordinal.
  *                     Do not use BLOCK - it is tied to command definition and implicit.
  *                     Leave zero for process call.
  * @retval SMBus stack return code
  */
HAL_StatusTypeDef STACK_SMBUS_HostCommand(SMBUS_StackHandleTypeDef *pStackContext, st_command_t* pCommand, uint16_t address, uint32_t direction)
{
  HAL_StatusTypeDef     result = STACK_BUSY;
  uint32_t              xFerOptions = SMBUS_FIRST_FRAME;
  uint8_t               *com_buffer;
  uint16_t              size;

