leonf08/SMBUS_PMBUS-Stack-STM32F407/SMBUS_Atolic/SMBUS_PMBUS_Stack/Src/stm32_SMBUS_stack.c
  /*
    First check status of the SMBUS - no transaction ongoing
  */
  if ( ( (pStackContext->StateMachine) & SMBUS_SMS_ACTIVE_MASK ) == 0 )
  {
    if ( pCommand == NULL )
    {
      /*
      quick command case
      */
      size = 0;
      xFerOptions = SMBUS_FIRST_AND_LAST_FRAME;

      /* set buffer to NULL to remove autoend and manage STOP by SW */
      com_buffer = NULL;
    }
    else
    {
      /* set buffer to current context */
      com_buffer = pStackContext->Buffer;

      /*
          Remembering the address and command code for case of further processing of non-trivial command
        */
      pStackContext->SlaveAddress = address;
      pStackContext->CurrentCommand = pCommand;

      /*
      First byte, the command code is transmitted
      */
      com_buffer[0] = pCommand->cmnd_code;

      if ( ( pCommand->cmnd_query & BLOCK ) && ( direction != READ ) )
      {
        /*
            Block write and process call with data size prepared in the buffer.
            Data size is limited to STACK_NBYTE_SIZE
          */
        if (com_buffer[1] > STACK_NBYTE_SIZE )
        {
          com_buffer[1] = STACK_NBYTE_SIZE;
        }
        size = 2 + com_buffer[1];            /* 1 cmd code + 1 count + data size */
      }
      else
      {
        if ( direction == READ )
        {
          /*
            transmitting only the command code, then begins the read phase
          */
          size = 1;
        }
        else
        {
          /*
            fixed size write
          */
          size = pCommand->cmnd_master_Tx_size;
        }
      }

      if ( pCommand->cmnd_query == BLK_PRC_CALL)
      {
        /*
          Process call starts as BLOCK_WRITE mode
        */
        pStackContext->OpMode = BLOCK_WRITE;
        xFerOptions = SMBUS_FIRST_FRAME;
      }
      else
      {
        /*
          Check direction sanity and mark direction (mainly for READ_OR_WRITE kind of command)
        */
        if (
          ( pCommand->cmnd_query & READ_OR_WRITE ) &&
          ( ( direction != WRITE ) && ( direction != READ ) )
        )
        {
          result = STACK_ERROR;
        }
        else
        {
          pStackContext->OpMode = direction;

          /*
          In case of Write this is a last frame too
          */
          if (( direction == WRITE ) || ( direction == BLOCK_WRITE ))
          {
            /*
              Size of transmission may include the PEC byte
              */
            xFerOptions = SMBUS_FIRST_AND_LAST_FRAME | ( pStackContext->StateMachine & SMBUS_SMS_PEC_ACTIVE );
            if (pStackContext->StateMachine & SMBUS_SMS_PEC_ACTIVE )
            {
              size += 1; /* PEC_SIZE */
            }
          }
        }
      }
    }

    if ( result != STACK_ERROR )
    {

      /*
      Initiating a transmission - even for a Read the command code is sent first
      */
      pStackContext->StateMachine |= SMBUS_SMS_TRANSMIT;
      pStackContext->StateMachine &= ~SMBUS_SMS_READY;

      /*
        Sending the data and logging the result
      */
      result = HAL_SMBUS_Master_Sequential_Transmit_IT( pStackContext->Device, address, com_buffer, size, xFerOptions );
      if (result != HAL_OK )
      {
        pStackContext->StateMachine |= SMBUS_SMS_ERROR;
      }
    }
  }
  return result;
}

/**
  * @brief  SMBUS notify host command transmit.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the context information for the specified SMBUS stack.
  * @retval HAL_StatusTypeDef SMBus stack return code
  */
HAL_StatusTypeDef STACK_SMBUS_NotifyHost(SMBUS_StackHandleTypeDef *pStackContext)
{
  HAL_StatusTypeDef     result = STACK_BUSY;
  uint32_t              xFerOptions = SMBUS_FIRST_AND_LAST_FRAME;

  /*
     First check status of the SMBUS - no transaction ongoing
   */
  if (( (pStackContext->StateMachine) & SMBUS_SMS_ACTIVE_MASK ) == 0 )
  {
    /*
      Remembering the address and command code for case of further processing of non-trivial command
    */
    pStackContext->SlaveAddress = SMBUS_ADDR_HOST;
    pStackContext->CurrentCommand = &HOST_NOTIFY_PROTOCOL;

    /*
      First byte, the return address is transmitted
    */
    if ( ( pStackContext->OwnAddress == 0 ) || (( pStackContext->StateMachine & SMBUS_SMS_ARP_AR) == 0 ) )
    {
      /* no address resolved yet, initiating the ARP */
      pStackContext->Buffer[0] = SMBUS_ADDR_DEFAULT;
    }
    else
    {
      /* own address known and recognized */
      pStackContext->Buffer[0] = pStackContext->OwnAddress;
    }

    pStackContext->OpMode = WRITE;

    /*
    Initiating a transmission - even for a Read the command code is sent first
    */
    pStackContext->StateMachine |= SMBUS_SMS_TRANSMIT;
    pStackContext->StateMachine &= ~SMBUS_SMS_READY;

    /*
      Sending the data and logging the result
    */
    result = HAL_SMBUS_Master_Sequential_Transmit_IT( pStackContext->Device, SMBUS_ADDR_HOST, pStackContext->Buffer, 3, xFerOptions );
    if (result != HAL_OK )
    {
      pStackContext->StateMachine |= SMBUS_SMS_ERROR;
    }
  }
  return result;
}

/**
  * @brief  SMBUS master command receive - only usable for quick command (read) and receive byte.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the context information for the specified SMBUS stack.
  * @param  pData  : pointer to the variable where response should be stored
  * @param  address : slave address to be used in the transmission
  * @retval HAL_StatusTypeDef SMBus stack return code
  */
HAL_StatusTypeDef STACK_SMBUS_HostRead(SMBUS_StackHandleTypeDef *pStackContext, uint8_t* pData, uint16_t address)
{
  HAL_StatusTypeDef     result = STACK_BUSY;
  uint8_t               size;
  uint32_t              xFerOptions;

