leonf08/SMBUS_PMBUS-Stack-STM32F407/SMBUS_Atolic/SMBUS_PMBUS_Stack/Src/stm32_SMBUS_stack.c
  /*
    First check state of the SMBUS
   */
  if ( ( pStackContext->StateMachine & SMBUS_SMS_READY ) == SMBUS_SMS_READY )
  {
    /*
      State transition from Ready to Reception
    */
    pStackContext->StateMachine &= ~SMBUS_SMS_READY;
    pStackContext->StateMachine |= SMBUS_SMS_RECEIVE;

    /*
      May be a receive byte ( then we need pointer to store reply ) or quick command read
    */
    if ( pData == NULL )
    {
      size = 0;
      xFerOptions = SMBUS_FIRST_AND_LAST_FRAME;
    }
    else
    {
      size = 1;
      if (pStackContext->StateMachine & SMBUS_SMS_PEC_ACTIVE )
      {
        size += PEC_SIZE;
      }
      xFerOptions = SMBUS_FIRST_AND_LAST_FRAME | ( pStackContext->StateMachine & SMBUS_SMS_PEC_ACTIVE );
    }

    /*
      Ordering the HAL to do single frame read operation, checking the result
    */
    result = HAL_SMBUS_Master_Sequential_Receive_IT( pStackContext->Device, address, pData, size, xFerOptions );
    if (result != HAL_OK )
    {
      pStackContext->StateMachine |= SMBUS_SMS_ERROR;
    }
  }

  return result;
}

/**
  * @brief  Callback function notifying slave about command incoming.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the context information for the specified SMBUS stack.
  * @retval HAL_StatusTypeDef response code. STACK_OK if success, any other value means problem
  */
__weak HAL_StatusTypeDef STACK_SMBUS_ExecuteCommand( SMBUS_StackHandleTypeDef* pStackContext )
{
  /*
    Host should implement here it's reaction to Host notify protocol and ARP Host notify.
    Regular devices implement all the commands they support.
   */

  /*
    Returning zero means no problem with execution, if reply is expected, then it is correctly placed in the IO buffer
   */
  return STACK_OK;
}

/**
  * @brief  Callback function notifying application about command extension.
  * @param  pStackContext : Pointer to a SMBUS_StackHandleTypeDef structure that contains
  *                the context information for the specified SMBUS stack.
  * @retval HAL_StatusTypeDef response code. STACK_OK if success, any other value means problem
  */
__weak HAL_StatusTypeDef STACK_SMBUS_ExtendCommand( SMBUS_StackHandleTypeDef* pStackContext )
{
  /*
    Host should implement here it's reaction to Host notify protocol and ARP Host notify.
    Regular devices implement all the commands they support.
   */

  /*
    Returning zero means no problem with execution, if reply is expected, then it is correctly placed in the IO buffer
   */
  return STACK_OK;
}

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
